// 1)+ - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >= 3) {
//     console.log('Це великий масив, в якому  3 і більше елементи.');
// } else {
//     console.log('Це маленький масив, в якому менше 3-х елементів.')
// }
// console.log(friends);

// 2)+ - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
// let a = +prompt('Введите a');//1 1 3 3 5 5
// let b = +prompt('Введите b');//5 3 1 5 1 3
// let c = +prompt('Введите c');//3 5 5 1 3 1
// //3,5,1 - прОклятая комбинация
// if ((a > b && a < c) || (a < c && a > b)) {
//     console.log(`${a} среднее число`);
// } else if ((b > a && b < c) || (b > c && b < a)) {
//     console.log(`${b} среднее число`);
// } else if ((c > a && c < b) || (c > b && c < a)) {
//     console.log(`${c} среднее число`);
// } else {
//     console.log(`${a} среднее число`);
// }

// 3)+ - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
// let a = 3;
// let b = 2;
// let result = (a + b < 4 ? 'Мало' : 'Багато');
// console.log(result);

// 4)+ - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
// let numb = +prompt('Введите число от -100 до 100.');
// if (numb === 0) {
//     console.log('Вы ввели 0');
// } else if (numb > 0) {
//     console.log('Ваше число положительное.');
// } else {
//     console.log('Ваше число отрицательное.')
// }




